kb1c/src/Catalogs/КомментарииБазыЗнаний/КомментарииБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомментарииБазыЗнаний</name>
  <owners>Catalog.СтатьиБазыЗнаний</owners>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАвтор</name>
    <type>
      <types>CatalogRef.ПользователиБазыЗнаний</types>
    </type>
  </attributes>
</mdclass:Catalog>

kb1c/src/InformationRegisters/СвязьКомментариевБазыЗнаний/СвязьКомментариевБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязьКомментариевБазыЗнаний</name>
  <dimensions>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.КомментарииБазыЗнаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.КомментарииБазыЗнаний</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

kb1c/src/InformationRegisters/ОповещенияБазыЗнаний/ОповещенияБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОповещенияБазыЗнаний</name>
  <resources>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КомментарииБазыЗнаний</types>
      <types>CatalogRef.СтатьиБазыЗнаний</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОповещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

kb1c/src/Enums/ВидыНовостейБазыЗнаний/ВидыНовостейБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНовостейБазыЗнаний</name>
  <enumValues>
    <name>Создание</name>
  </enumValues>
  <enumValues>
    <name>Изменение</name>
  </enumValues>
  <enumValues>
    <name>Удаление</name>
  </enumValues>
  <enumValues>
    <name>Оповещение</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

kb1c/src/Catalogs/КомментарииБазыЗнаний/ObjectModule.bsl
Перем РодительСсылка Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ МЕТОДЫ

Функция ПолучитьРодителяКомментария(КомментарийСсылка)
	
	Возврат Справочники.КомментарииБазыЗнаний.ПолучитьЗначениеРодитель(КомментарийСсылка);
	
КонецФункции

Функция ПолучитьПользователейДляОповещения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КомментарииБазыЗнаний.Владелец.Ответственный КАК Пользователь,
	|	1 КАК ВидОповещения
	|ИЗ
	|	Справочник.КомментарииБазыЗнаний КАК КомментарииБазыЗнаний
	|ГДЕ
	|	КомментарииБазыЗнаний.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СвязьКомментариевБазыЗнаний.Родитель.Автор,
	|	2
	|ИЗ
	|	РегистрСведений.СвязьКомментариевБазыЗнаний КАК СвязьКомментариевБазыЗнаний
	|ГДЕ
	|	СвязьКомментариевБазыЗнаний.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидОповещения";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаписатьОповещениеПользователей()
	
	ЭтоНовый = (ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") И ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый);
	Если НЕ ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	Получатели = ПолучитьПользователейДляОповещения();
	
	Если Получатели.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Обработанные = Новый Массив;
	НаборЗаписей = РегистрыСведений.ОповещенияБазыЗнаний.СоздатьНаборЗаписей();
	Для Каждого СтрокаТаблицы Из Получатели Цикл
		Если Обработанные.Найти(СтрокаТаблицы.Пользователь) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.ВидОповещения = 1 Тогда
			СтрОписание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Получен новый комментарий к статье %1 
				|от пользователя %2'"),
				Строка(ЭтотОбъект.Владелец),
				Строка(ЭтотОбъект.Автор));
		ИначеЕсли СтрокаТаблицы.ВидОповещения = 2 Тогда
			СтрОписание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Новый ответ от пользователя %1'"),
				Строка(ЭтотОбъект.Автор));
		КонецЕсли;
		
		ЗаписьРегистра = НаборЗаписей.Добавить();
		ЗаписьРегистра.Пользователь		= СтрокаТаблицы.Пользователь;
		ЗаписьРегистра.ВидОповещения	= 1; // см. подсказку к измерению регистра
		ЗаписьРегистра.Идентификатор	= Новый УникальныйИдентификатор;
		ЗаписьРегистра.Объект			= ЭтотОбъект.Ссылка;
		ЗаписьРегистра.ВидСобытия		= СтрокаТаблицы.ВидОповещения; // см. модуль менеджера регистра
		ЗаписьРегистра.Описание			= СтрОписание;
		
		Обработанные.Добавить(СтрокаТаблицы.Пользователь);
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ОбновитьСтатистикуКомментариев()
	
	ПараметрыВыполнения = Новый Структура("Статья", ЭтотОбъект.Владелец);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ПараметрыВыполнения);
	
	ФоновыеЗадания.Выполнить(
		"БазаЗнаний.ОбновитьКоличествоКомментариев",
		МассивПараметров, ,
		"Обновление количества комментариев");
	
КонецПроцедуры

// ТипНовости: 1 - создание, 2 - изменение, 3 - удаление
Функция ДобавитьНовостьБазыЗнаний(ТипНовости)
	
	ПараметрыСсылкиОтв	= Новый Структура("id", Строка(ЭтотОбъект.Автор.УникальныйИдентификатор()));
	АдресСсылкиОтв		= БазаЗнанийAPIКлиентСервер.КонструкторСсылки_page("user", ПараметрыСсылкиОтв);
	
	ПараметрыСсылкиСтат	= Новый Структура("id", Строка(ЭтотОбъект.Владелец.УникальныйИдентификатор()));
	АдресСсылкиСтат		= БазаЗнанийAPIКлиентСервер.КонструкторСсылки_page("article", ПараметрыСсылкиСтат);
	
	ПараметрыСсылкиКомм	= ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ПараметрыСсылкиСтат);
	ПараметрыСсылкиКомм.Вставить("section", "comment_" + Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор()));
	АдресСсылкиКом		= БазаЗнанийAPIКлиентСервер.КонструкторСсылки_page("article", ПараметрыСсылкиКомм);
	
	Если ТипНовости = 1 Тогда
		ВидНовости	= Перечисления.ВидыНовостейБазыЗнаний.Создание;
		Заголовок	= "Новый комментарий в статье '%3' от пользователя %4";
		НовостьHTML	= "<div>%1 в %2 добавлен новый комментарий к статье <a href='" + АдресСсылкиСтат + "'>%3</a>.
		|	<br>Автор: <a href='" + АдресСсылкиОтв + "'>%4</a>
		|	<br>Текст: %5.
		|	<br><a href='" + АдресСсылкиКом + "'>Перейти</a>
		|</div>";
	ИначеЕсли ТипНовости = 2 Тогда
		ВидНовости	= Перечисления.ВидыНовостейБазыЗнаний.Изменение;
		Заголовок	= "Изменен комментарий в статье '%3' от пользователя %4";
		НовостьHTML	= "<div>%1 в %2 изменен комментарий в статье <a href='" + АдресСсылкиСтат + "'>%3</a>.
		|	<br>Автор: <a href='" + АдресСсылкиОтв + "'>%4</a>
		|	<br>Текст: %5.
		|	<br><a href='" + АдресСсылкиКом + "'>Перейти</a>
		|</div>";
	ИначеЕсли ТипНовости = 3 Тогда
		ВидНовости	= Перечисления.ВидыНовостейБазыЗнаний.Удаление;
		Заголовок	= "Удален комментарий в статье '%3' от пользователя '%4'";
		НовостьHTML	= "<div>%1 в %2 удален комментарий в статье <a href='" + АдресСсылкиСтат + "'>%3</a>.
		|	<br>Автор: <a href='" + АдресСсылкиОтв + "'>%4</a>
		|	<br>Текст: %5.
		|</div>";
	КонецЕсли;
	
	ДатаНовости = ТекущаяДатаСеанса();
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Формат(ДатаНовости, "ДЛФ=DD"));
	МассивПараметров.Добавить(Формат(ДатаНовости, "ДФ=HH:mm"));
	МассивПараметров.Добавить(Строка(ЭтотОбъект.Владелец));
	МассивПараметров.Добавить(Строка(ЭтотОбъект.Автор));
	МассивПараметров.Добавить(ЭтотОбъект.Текст);
	
	Заголовок	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтрокуИзМассива(Заголовок, МассивПараметров);
	НовостьHTML	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтрокуИзМассива(НовостьHTML, МассивПараметров);
	
	Получатели	= Новый Массив;
	Если ЗначениеЗаполнено(РодительСсылка) Тогда
		ПользовательАвтор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РодительСсылка, "Автор");
		Если ПользовательАвтор <> Пользователи.ТекущийПользователь() Тогда
			Получатели.Добавить(ПользовательАвтор);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыНовости = Новый Структура;
	ПараметрыНовости.Вставить("Автор"				, ЭтотОбъект.Автор);
	ПараметрыНовости.Вставить("Заголовок"			, Заголовок);
	ПараметрыНовости.Вставить("ТекстHTML"			, НовостьHTML);
	ПараметрыНовости.Вставить("ОбъектБазыЗнаний"	, ЭтотОбъект.Ссылка);
	ПараметрыНовости.Вставить("Важность"			, 2);
	ПараметрыНовости.Вставить("Получатели"			, Получатели);
	ПараметрыНовости.Вставить("ВидНовости"			, ВидНовости);
	
	БазаЗнанийВызовСервера.ДобавитьНовость(ПараметрыНовости);
	
КонецФункции

Функция УдалитьНовостиБазыЗнаний()
	
	МассивСсылок = БазаЗнаний.ПолучитьНовостиПоОбъекту(ЭтотОбъект.Ссылка);
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("Ссылки", МассивСсылок);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ПараметрыВыполнения);
	
	ФоновыеЗадания.Выполнить(
		"БазаЗнаний.УдалитьНовости",
		МассивПараметров,
		,
		"Удаление новостей базы знаний по объекту");
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ МОДУЛЯ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстИзменился = ЭтотОбъект.ЭтоНовый();
	Если НЕ ТекстИзменился Тогда
		ТекущийТекст	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка, "Текст");
		ТекстИзменился	= (ТекущийТекст <> ЭтотОбъект.Текст);
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый"		, ЭтотОбъект.ЭтоНовый());
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТекстИзменился"	, ТекстИзменился);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый		= (ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") И ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый);
	ТекстИзменился	= (ЭтотОбъект.ДополнительныеСвойства.Свойство("ТекстИзменился") И ЭтотОбъект.ДополнительныеСвойства.ТекстИзменился);
	
	Если ЭтоНовый ИЛИ ТекстИзменился Тогда
		ДобавитьНовостьБазыЗнаний(?(ЭтоНовый, 1, 2));
	КонецЕсли;
	
	ТекущийРодитель = ПолучитьРодителяКомментария(ЭтотОбъект.Ссылка);
	Если ТекущийРодитель <> РодительСсылка И НЕ ТекущийРодитель.Пустая() Тогда
		РегистрыСведений.СвязьКомментариевБазыЗнаний.ОчиститьСвязь(ТекущийРодитель, ЭтотОбъект.Ссылка);
	КонецЕсли;
	Если НЕ РодительСсылка.Пустая() Тогда
		РегистрыСведений.СвязьКомментариевБазыЗнаний.УстановитьСвязь(РодительСсылка, ЭтотОбъект.Ссылка);
	КонецЕсли;
	
	Если ЭтоНовый Тогда
		ОбновитьСтатистикуКомментариев();
	КонецЕсли;
	
	//ЗаписатьОповещениеПользователей();
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	ДобавитьНовостьБазыЗнаний(3);
	УдалитьНовостиБазыЗнаний();
	
	РегистрыСведений.СвязьКомментариевБазыЗнаний.ОчиститьСвязь(РодительСсылка, ЭтотОбъект.Ссылка);
КонецПроцедуры

РодительСсылка = ПолучитьРодителяКомментария(ЭтотОбъект.Ссылка);
